БукмекерскаяКонтора/src/Catalogs/Игроки/Игроки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Игроки</name>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСеанса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектроннаяПочта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

БукмекерскаяКонтора/src/Catalogs/Игроки/Forms/Создать/Module.bsl
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ИдентификаторСеанса = ПараметрыСеанса.ИдентификаторСеанса;
КонецПроцедуры


Процедура ИзменитьПользователя(Пользователь, ТекущийОбъект, Отказ, НовыйПользователь)
	Логин = ТекущийОбъект.Наименование;
	Если не ПользователиИнформационнойБазы.НайтиПоИмени(Логин) = Неопределено и НовыйПользователь
	Тогда
		Сообщить("Пользователь с таким логином существует");
		Отказ = Истина;
	Иначе
		Пользователь.Имя = ТекущийОбъект.Наименование;
		Пользователь.Пароль = ТекущийОбъект.Пароль;
		Пользователь.ПолноеИмя = ТекущийОбъект.Фамилия + " " + ТекущийОбъект.Имя + " " + ТекущийОбъект.Отчество;
		Пользователь.Роли.Добавить(Метаданные.Роли.Игрок);
		Пользователь.Записать();
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если ПочтаИзмененаИлиНовыйОбъект()
	Тогда
		Сообщить("Здесь");
		Генератор = Новый ГенераторСлучайныхЧисел();
		Число = Генератор.СлучайноеЧисло(1000, 9999);
		ОтправитьПисьмо(ЭтотОбъект.Объект.ЭлектроннаяПочта, Число);
		Описание = "Введите код подтверждения";
		ВведенноеЧисло = 0;
		Введено = ВвестиЧисло(ВведенноеЧисло, Описание, 4, 0);
		Если не Введено или Число <> ВведенноеЧисло
		Тогда
			Отказ = Истина;
			Сообщить("Неверный код");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОтправитьПисьмо(АдресПочты, Число)
	Профиль = Новый ИнтернетПочтовыйПрофиль();
	Профиль.АдресСервераSMTP = "smtp.gmail.com";
	Профиль.ПользовательSMTP = "sayahov1998@gmail.com";
	Профиль.ПарольSMTP = "EnigmaCode";
	Профиль.АутентификацияSMTP = СпособSMTPАутентификации.ПоУмолчанию;
	
	Сообщение = Новый ИнтернетПочтовоеСообщение();
	Сообщение.Отправитель = "sayahov1998@gmail.com";
	Сообщение.Тема = "Букмекерская контора";
	Сообщение.Получатели.Добавить(АдресПочты);
	Сообщение.Тексты.Добавить("Код подтверждения: " + Число);
	
	Почта = Новый ИнтернетПочта();
	Попытка 
		Почта.Подключиться(Профиль);
		Почта.Послать(Сообщение);
		Сообщить("Код подтверждения отправлен на почту " + АдресПочты);
	Исключение
		Сообщить(""+ОписаниеОшибки());
	КонецПопытки; 
КонецПроцедуры

&НаСервере
Функция ПочтаИзмененаИлиНовыйОбъект()
	Если Параметры.Ключ.Пустая()
	Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Параметры.Ключ.ЭлектроннаяПочта <> ЭтотОбъект.Объект.ЭлектроннаяПочта;
КонецФункции

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Параметры.Ключ.Пустая()
	Тогда
		ИзменитьПользователя(ПользователиИнформационнойБазы.СоздатьПользователя(), ТекущийОбъект, Отказ, Истина);
	Иначе
		ИзменитьПользователя(ПользователиИнформационнойБазы.НайтиПоИмени(Параметры.Ключ.Наименование),
		 ТекущийОбъект, Отказ, Ложь);
	КонецЕсли;
КонецПроцедуры
